YBI Foundation Classes for AI and Machine Learning
Practice Notebook - 1

In [ ]:
import pandas as pd
dft = pd.read_csv('https://github.com/ybifoundation/Dataset/raw/26d662745d975c7ae516072e8e03bcd5c6c3d75a/Titanic.csv')

dft.info()
dft.name

In [ ]:
col = pd.DataFrame(dft.columns)
col

In [ ]:
# Selecting the 'name' column of the df and saving it as a pandas series
name = dft['name']
name

In [ ]:
# extracting a column from the df as a dataframe
name = dft[['name']]
name

In [ ]:
# selecting the 100th row and all columns with iloc
dft.iloc[100,:]

In [ ]:
dft.iloc[:,[2,8]]

In [ ]:
dft.iloc[:,[2,8]]
dft.loc[:,['name','fare']]

In [ ]:
dft.loc[[50,25,15],['pclass','fare','age']]
dft.iloc[[50,25,15],[0,8,4]]

In [ ]:
dft.loc[10:25,['pclass','fare','age']]
dft.iloc[10:26,[0,8,4]]

In [ ]:
# retrieve the records in a range of rows and columns
dft.iloc[10:16,0:5]
# dft.loc[10:15,'pclass':'age']

In [ ]:
# retrieve the records of all the passengers aged 35 and above
dft[dft['age']>=35]

In [40]:
# retrieve the same records as above, but from labels ranging from 'pclass' to 'age'
dft.loc[(dft['age']>=35),'pclass':'age']

,pclass,survived,name,sex,age
5,1,1,"Anderson, Mr. Harry",male,48.0
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0
...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0
1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0
1298,3,0,"Wittevrongel, Mr. Camille",male,36.0
1301,3,0,"Youseff, Mr. Gerious",male,45.5

In [44]:
# retrieve records of all female passengers with age>=35
dft.loc[(dft['age']>=35)&(dft['sex']=='female')]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
21,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S,5,NaN,"New York, NY"
23,1,1,"Bidois, Miss. Rosalie",female,42.0,0,0,PC 17757,227.5250,NaN,C,4,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1158,3,0,"Rosblom, Mrs. Viktor (Helena Wilhelmina)",female,41.0,0,2,370129,20.2125,NaN,S,NaN,NaN,NaN
1211,3,0,"Skoog, Mrs. William (Anna Bernhardina Karlsson)",female,45.0,1,4,347088,27.9000,NaN,S,NaN,NaN,NaN
1261,3,1,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S,15,NaN,NaN
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN